export const FilterOptions = {
  payment_method: [
    'Платіжні картки',
    'Електронні гаманці',
    'Онлайн-банкінг',
    'Р2Р',
    'Банківські перекази',
    'Платежі через QR-коди',
    'Платежі у месенджерах',
    'Мобільні платежі',
    'Купівля в розстрочку',
  ],
  country: ['міжнародний', 'перелік країн'],
  currency: ['AED', 'AUD', 'BGN', 'BHD', 'CAD', 'CHF', 'CRC', 'CZK', 'DKK', 'DOP'],
  functional: [
    'Одностадійна оплата',
    'Двостадійна оплата',
    'Часткове зарахування резерву',
    'Повернення, Часткове повернення',
    'Збір даних про платників',
    'Регулярні платежі',
    'Р2Р-перекази',
    'Розрахунки з контрагентами та користувачами',
    'Спліт-платежі, 3D Secure',
    'Токенізація карткових даних',
    'Робота з диспутами',
    'Брендовані чекаути',
  ],
  integration: ['API Direct', 'API Hosted', 'Мобільний SDK', 'Платіжні посилання'],
};

export const columns = [
  {
    Header: 'Платіжний метод',
    accessor: 'payment_method',
    filterOptions: FilterOptions.payment_method,
    filterColumn: 'payment_method',
    filterPlaceholder: 'Оберіть тип',
    width: 180,
  },
  {
    Header: 'Регіон',
    accessor: 'country',
    filterOptions: FilterOptions.country,
    filterPlaceholder: 'Регіон',
    width: 180,
  },
  {
    Header: 'Валюта',
    accessor: 'currency',
    filterOptions: FilterOptions.currency,
    filterPlaceholder: 'Всі',
  },
  {
    Header: 'Функціонал',
    accessor: 'functional',
    filterOptions: FilterOptions.functional,
    width: 180,
    filterPlaceholder: 'Всі',
  },
  {
    Header: 'Інтеграція',
    accessor: 'integration',
    filterOptions: FilterOptions.integration,
    width: 180,
    filterPlaceholder: 'Всі',
  },
  {
    Header: '',
    accessor: 'clear-button',
    width: 32,
  },
];

export const data = [
  {
    payment_method: ['Платіжні картки'],
    payment_name: 'Visa',
    country: ['Міжнародний'],
    currency: ['AUD', 'BGN', 'BRL', 'CAD', 'CHF'],
    functional: ['Одностадійна оплата', 'Двостадійна оплата', 'Часткове зарахування резерву'],
    integration: ['API Direct', 'API Hosted', 'Мобільний SDK', 'Платіжні посилання'],
  },
  {
    payment_method: ['Платіжні картки'],
    payment_name: 'MasterCard',
    country: ['Міжнародний'],
    currency: ['AED'],
    functional: ['Одностадійна оплата', 'Двостадійна оплата', 'Часткове зарахування резерву'],
    integration: ['API Direct', 'API Hosted', 'Мобільний SDK', 'Платіжні посилання'],
  },
];

export const businessBenefits = [
  {
    caption: 'Швидкий старт порівняно з розробкою PSP з нуля',
    text: 'Формування команди, проєктування сервісів, розгортання інфраструктури, сертифікація, пошук партнерів, — разом з усіма цими етапами розробка свого PSP займає близько 2-х років. Чи варто відкладати запуск ваших мерчантів на такий строк? Адже можна обрати white-lebel PSP і стати провайдером платежів вже за місяць.  ',
  },
  {
    caption: 'Широкий набір готових інтеграцій',
    text: 'Зараз вам буде доступно 50+ платіжних методів, і цей список постійно розширюється, а для додавання нових методів вам не потрібно буде проводити жодних додаткових налаштувань',
  },
  {
    caption: 'Усі сервіси — під вашим брендом',
    text: 'Ми зробимо кастомізацію та брендування усіх сторінок та сервісів, з якими будуть взаємодіяти ваші мерчанти: платіжна сторінка, документація, мерчант-портал, що ще?. Вони будуть у вашому фірмовому стилі та на вашому домені.',
  },
  {
    caption: 'Розумний роутинг та каскадинг',
    text: 'Наша смарт-система маршрутизації забезпечує високу конверсію платежів. Вона дозволяють здійснювати оцінку різноманітних критеріїв та параметрів платежу і скеровувати його за напрямком, що забезпечує найвищий показник успішності платежів. ',
  },
  {
    caption: 'Безпека даних та антифрод',
    text: 'Вам не треба проходити сертифікацію та будувати власну систему захисту від шахраїв. Про це потурбуємося ми. Ми використовуємо шифрування та токенізацію даних, а наша система відповідає найвищому стандарту захисту даних в платіжній індустрії — PCI DSS Level 1. А наша трирівнева антифрод-система у лайв-режимі моніторить та блокує підозрілі транзакції.',
  },
  {
    caption: 'Просте масштабування на міжнародних ринках',
    text: 'Це рішення дозволяє здійснювати міжнародні платежі із використанням різноманітних платіжних методів та валют. Це спрощує вихід на глобальний ринок як для вас, так і для мерчантів, з якими ви будете працювати. ',
  },
];

export const categoriesBlock = [
  {
    caption: 'API Only',
    text: 'Клієнту не потрібно вказувати дані картки. Достатньо обрати Apple Pay на чекауті та підтвердити оплату. ',
    link: '/docs/intro',
    col: 4,
  },
  {
    caption: 'API Only',
    text: 'Клієнту не потрібно вказувати дані картки. Достатньо обрати Apple Pay на чекауті та підтвердити оплату. ',
    link: '/docs/intro',
    col: 4,
  },
  {
    caption: 'API Only',
    text: 'Клієнту не потрібно вказувати дані картки. Достатньо обрати Apple Pay на чекауті та підтвердити оплату. ',
    link: '/docs/intro',
    col: 4,
  },
  {
    caption: 'API Only',
    text: 'Клієнту не потрібно вказувати дані картки. Достатньо обрати Apple Pay на чекауті та підтвердити оплату. ',
    link: '/docs/intro',
    col: 6,
  },

  {
    caption: 'API Only',
    text: 'Клієнту не потрібно вказувати дані картки. Достатньо обрати Apple Pay на чекауті та підтвердити оплату. ',
    link: '/docs/intro',
    col: 6,
  },
];
